app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user = current_user

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "author", "year", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "yo"], ["author", "yo"], ["year", "2020-10-22 01:07:00"], ["user_id", 5], ["created_at", "2020-10-22 01:08:06.982781"], ["updated_at", "2020-10-22 01:08:06.982781"]]