app/controllers/storages_controller.rb

SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @books = current_user.books
    @store = Store.find(params[:id])

SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "storages" ("store_id", "book_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["store_id", 23], ["book_id", 1], ["quantity", 1], ["created_at", "2020-10-22 02:33:00.588106"], ["updated_at", "2020-10-22 02:33:00.588106"]]
---
  def create
    @store = Store.find(params[:id])
    @storage = @store.storage.create(storage_params)

UPDATE "storages" SET "quantity" = $1, "updated_at" = $2 WHERE "storages"."id" = $3  [["quantity", 4], ["updated_at", "2020-10-22 03:40:18.430622"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @storage.update(storage_params)

DELETE FROM "storages" WHERE "storages"."id" = $1  [["id", 16]]
---
  def destroy
    @storage.destroy

SELECT "storages".* FROM "storages" WHERE "storages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_storage
      @storage = Storage.find(params[:id])