app/controllers/stores_controller.rb

SELECT "stores".* FROM "stores" WHERE "stores"."user_id" = $1  [["user_id", 5]]
---
  def index
    if current_user.present?
      @stores = current_user.stores
    else
      @stores = Store.all

INSERT INTO "stores" ("codename", "address", "Phone", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["codename", 5656], ["address", "Monterrey"], ["Phone", 83567890], ["created_at", "2020-10-29 22:38:11.716941"], ["updated_at", "2020-10-29 22:38:11.716941"], ["user_id", 5]]
---
  def create

    @store = Store.new store_params
    @store.user = current_user
    if @store.save

SELECT "storages".* FROM "storages" WHERE "storages"."store_id" = $1  [["store_id", 23]]
SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
---
  def show
    @storages = Store.find(params[:id]).storage

UPDATE "stores" SET "codename" = $1, "address" = $2, "Phone" = $3, "updated_at" = $4 WHERE "stores"."id" = $5  [["codename", 1212], ["address", "Guadalupe"], ["Phone", 83909080], ["updated_at", "2020-10-29 22:44:12.031665"], ["id", 24]]
---
  def update
    @store.update store_params

DELETE FROM "stores" WHERE "stores"."id" = $1  [["id", 23]]
---
  def destroy
    @store.destroy

SELECT "stores".* FROM "stores" WHERE "stores"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
---
  def set_store
    @store = Store.find params[:id]